#### Terraform Plan 📖 `failure`

<details><summary>Show Plan</summary>

```

module.email_function.data.external.main: Reading...
module.email_function.data.archive_file.main: Reading...
module.email_function.data.external.main: Read complete after 0s [id=-]
module.email_function.data.archive_file.main: Read complete after 0s [id=9946765dd74664e369dab6dd9c11eb00f3eedbdb]
module.email_function.terraform_data.commit_sha: Refreshing state... [id=84b70d3b-e33e-8184-e7b4-7c28959e8e5d]
data.aws_cloudfront_cache_policy.managed_caching_optimized: Reading...
module.email_function.data.aws_ssm_parameter.custom[0]: Reading...
data.aws_cloudfront_origin_request_policy.managed_cors_s3_origin: Reading...
module.email_function.data.aws_kms_alias.ssm: Reading...
data.aws_iam_openid_connect_provider.github: Reading...
data.aws_caller_identity.current: Reading...
aws_s3_account_public_access_block.main: Refreshing state... [id=220746603587]
aws_cloudfront_origin_access_control.care_bear_shooter_build_bucket: Refreshing state... [id=E9UD6HRKKYL4H]
aws_api_gateway_rest_api.main: Refreshing state... [id=xguhlotnsl]
aws_cloudwatch_event_bus.api_gateway: Refreshing state... [id=api-gateway]
data.aws_caller_identity.current: Read complete after 0s [id=220746603587]
aws_cloudwatch_metric_alarm.lambda_throttles: Refreshing state... [id=lambda-throttles]
aws_s3_bucket.aws_config: Refreshing state... [id=config-bucket-220746603587]
data.aws_cloudfront_cache_policy.managed_caching_optimized: Read complete after 0s [id=b2884449-e4de-46a7-ac36-70bc7f1ddd6d]
aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway]
data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::220746603587:oidc-provider/token.actions.githubusercontent.com]
aws_s3_bucket.care_bear_shooter_build: Refreshing state... [id=care-bear-shooter-build-220746603587]
data.aws_cloudfront_origin_request_policy.managed_cors_s3_origin: Read complete after 0s [id=88a5eaf4-2fd4-4709-b370-b4c650ea3fcf]
module.email_function.data.aws_kms_alias.ssm: Read complete after 0s [id=arn:aws:kms:eu-central-1:220746603587:alias/aws/ssm]
aws_api_gateway_account.main: Refreshing state... [id=api-gateway-account]
module.email_function.data.aws_ssm_parameter.custom[0]: Read complete after 0s [id=/email-function/mailgun-api-key]
module.email_function.aws_iam_role.main: Refreshing state... [id=terraform-20240206183643547800000002]
aws_api_gateway_resource.email_function: Refreshing state... [id=7af8s0]
aws_cloudwatch_log_group.api_gateway_stage_default: Refreshing state... [id=API-Gateway-Execution-Logs_xguhlotnsl/default]
aws_api_gateway_request_validator.validate_request_body: Refreshing state... [id=aijdpj]
aws_cloudwatch_metric_alarm.api_gateway_5xx_error: Refreshing state... [id=api-gateway-5xx-error]
module.email_function.aws_api_gateway_model.request_body: Refreshing state... [id=2vo1yf]
module.email_function.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-xguhlotnsl-7af8s0-POST-200]
module.email_function.aws_api_gateway_method.main: Refreshing state... [id=agm-xguhlotnsl-7af8s0-POST]
module.email_function.aws_lambda_function.main: Refreshing state... [id=email-function]
module.email_function.aws_api_gateway_integration_response.response_200: Refreshing state... [id=agir-xguhlotnsl-7af8s0-POST-200]
aws_iam_role.aws_config: Refreshing state... [id=aws-config]
aws_s3_bucket_lifecycle_configuration.aws_config: Refreshing state... [id=config-bucket-220746603587]
aws_iam_role.care_bear_shooter_build_uploader: Refreshing state... [id=care-bear-shooter-build-uploader]
aws_s3_bucket_cors_configuration.care_bear_shooter_build: Refreshing state... [id=care-bear-shooter-build-220746603587]
aws_cloudfront_distribution.care_bear_shooter_build: Refreshing state... [id=E3GY8A42OQ8RFW]
aws_s3_bucket_policy.care_bear_shooter_build_cloudfront: Refreshing state... [id=care-bear-shooter-build-220746603587]
aws_config_configuration_recorder.default: Refreshing state... [id=default]
aws_config_delivery_channel.default: Refreshing state... [id=default]
aws_config_configuration_recorder_status.default: Refreshing state... [id=default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.email_function.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "email-function"
      ~ last_modified                  = "2024-02-06T19:02:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "8bEj6QEYIwMJ5BUUeUvqUYOZfkNGw8+J/QTabxSbwOg=" -> "gDKmcFYXkpCqgSmZ0F6GNazBk6HzfBu0kJKBTuYRjtw="
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "COMMIT_SHA" = "a27f2f74e7faa1a986e105ae3d4d3cc314651459"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.email_function.terraform_data.commit_sha must be replaced
-/+ resource "terraform_data" "commit_sha" {
      ~ id               = "84b70d3b-e33e-8184-e7b4-7c28959e8e5d" -> (known after apply)
      ~ input            = "a27f2f74e7faa1a986e105ae3d4d3cc314651459" -> "60fb4fa27b221b9e549918f4f5e749be65bd8aae"
      ~ output           = "a27f2f74e7faa1a986e105ae3d4d3cc314651459" -> (known after apply)
      ~ triggers_replace = "8bEj6QEYIwMJ5BUUeUvqUYOZfkNGw8+J/QTabxSbwOg=" -> "gDKmcFYXkpCqgSmZ0F6GNazBk6HzfBu0kJKBTuYRjtw="
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>